In [1]:
import csv
import json
import pandas as pd

In [3]:
data = {}
df = pd.read_csv('the_oscar_award.csv')

In [14]:
df.head()

,year_film,year_ceremony,ceremony,category,name,film,winner
0,1927,1928,1,ACTOR,Richard Barthelmess,The Noose,False
1,1927,1928,1,ACTOR,Emil Jannings,The Last Command,True
2,1927,1928,1,ACTRESS,Louise Dresser,A Ship Comes In,False
3,1927,1928,1,ACTRESS,Janet Gaynor,7th Heaven,True
4,1927,1928,1,ACTRESS,Gloria Swanson,Sadie Thompson,False

In [16]:
df.dtypes

year_film         int64
year_ceremony     int64
ceremony          int64
category         object
name             object
film             object
winner             bool
dtype: object

In [18]:
b = df.select_dtypes(include=[bool])
boolean_Dict = {True: 'TRUE', False: 'FALSE'}

for col_winner in b:
    df[col_winner] = df[col_winner].map(boolean_Dict)

In [19]:
df.dtypes

year_film         int64
year_ceremony     int64
ceremony          int64
category         object
name             object
film             object
winner           object
dtype: object

In [22]:
df = df.loc[df['winner'] == 'TRUE']

In [23]:
df.head()

,year_film,year_ceremony,ceremony,category,name,film,winner
1,1927,1928,1,ACTOR,Emil Jannings,The Last Command,TRUE
3,1927,1928,1,ACTRESS,Janet Gaynor,7th Heaven,TRUE
6,1927,1928,1,ART DIRECTION,William Cameron Menzies,The Dove;,TRUE
9,1927,1928,1,CINEMATOGRAPHY,Charles Rosher,Sunrise,TRUE
10,1927,1928,1,CINEMATOGRAPHY,Karl Struss,Sunrise,TRUE

In [24]:
groupby = df.groupby(["film","year_ceremony"]).count().sort_values(by="winner",ascending=False, na_position='first')[{"winner"}]

In [25]:
groupby

                                                             winner
film                                          year_ceremony
Titanic                                       1998               11
Ben-Hur                                       1960               11
The Lord of the Rings: The Return of the King 2004               11
West Side Story                               1962               10
The Last Emperor                              1988                9
...                                                             ...
Knighty Knight Bugs                           1959                1
Kokoda Front Line!                            1943                1
Kolya                                         1997                1
Kon-Tiki                                      1952                1
tom thumb                                     1959                1

[1286 rows x 1 columns]

In [26]:
new_df = groupby.nlargest(10, 'winner').reset_index()[{"film", "winner"}]

In [27]:
new_df

   winner                                           film
0      11                                        Titanic
1      11                                        Ben-Hur
2      11  The Lord of the Rings: The Return of the King
3      10                                West Side Story
4       9                               The Last Emperor
5       9                                           Gigi
6       9                            The English Patient
7       8                            Slumdog Millionaire
8       8                                        Cabaret
9       8                              On the Waterfront

In [28]:
new_df.set_index("film", inplace = True)

In [29]:
new_df

                                               winner
film
Titanic                                            11
Ben-Hur                                            11
The Lord of the Rings: The Return of the King      11
West Side Story                                    10
The Last Emperor                                    9
Gigi                                                9
The English Patient                                 9
Slumdog Millionaire                                 8
Cabaret                                             8
On the Waterfront                                   8

In [30]:
new_df.to_csv("NEW_the_oscar_award.csv")